# 4.1. Перемістити всі нулі до кінця списку

# Оголошуємо змінні типу список
my_lst = [9, 0, 7, 31, 0, 45, 0, 45, 0, 45, 0, 0, 96, 0]
lst_zeros = []
lst_non_zeros = []

# Проходимось по списку циклом і віддяляємо нулі
for item in my_lst:
    if item == 0:
        lst_zeros.append(item)
    else:
        lst_non_zeros.append(item)

# Очищаємо список і додаємо список цифр до яких додаємо список нулів
my_lst.clear()
my_lst += lst_non_zeros
my_lst += lst_zeros

# Виводимо результат роботи програми
print("Результат роботи програми по пемеміщенню "
      "нулів у кінець списку")
print(my_lst)
