# Створимо простий калькулятор. Напишіть програму, яка запитує у
# користувача два цілих числа і виконує такі дії:
# - обчислює суму та виводить результат.
# - обчислює різницю і виводить результат (перше число мінус друге число).
# - обчислює добуток та виводить результат.
# - обчислює ділення (результат поділу першого числа на друге) та виводить
#   результат.
# - обчислює залишок від поділу першого числа на друге та виводить результат.
# - Зводить перше число у ступінь другого числа та виводить результат.

# Приклад:
# Введіть перше число: 5
# Введіть друге число: 2

# Сума: 7
# Різниця: 3
# Добуток: 10
# Ділення: 2.5
# Залишок від ділення: 1
# Перше число у ступені другого числа: 25

fist_num = int(input("Перше число "))
sec_num = int(input("Друге число "))

print("Cума: " + str(fist_num + sec_num))
print("Різниця " + str(fist_num - sec_num))
print("Добуток " + str(fist_num * sec_num))
print("Ділення " + str(fist_num / sec_num))
print("Залишок від ділення " + str(fist_num % sec_num))
print("Перше число у ступені другого числа " + str(fist_num ** sec_num))