# Написати програму використовуючи функції input() та print().
# Програма вимагає ввести довільну строку. Потім необхідно створити 2
# строкові змінні, перша з яких складається лише з парних символів введеної
# строки, а друга складається з введеної строки, написаної у зворотній
# послідовності, при цьому всі літери повинні бути написані у верхньому регістрі.
#
# Як результат вивести введену строку та дві нові строки, що вийшли, кожну з нового рядка.

my_str = input("Enter your sentence: ")

fist_str = my_str[:-1:2]
second_str = my_str[-1::-1].upper()

print(my_str)
print(fist_str)
print(second_str)
print('OK')